# ReloadBeforeMakeEditable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ReloadBeforeMakeEditable Property
BuiltInFailures..::..EditingFailures Class See Also
---
You must Reload Latest before editing the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReloadBeforeMakeEditable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReloadBeforeMakeEditable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReloadBeforeMakeEditable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace